In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn

In [6]:
df = pd.DataFrame(randn(4, 3), ['a', 'b', 'c', 'd'], ['X', 'Y', 'Z'])

In [7]:
df

          X         Y         Z
a -0.075704  0.063832 -0.584938
b -0.336259  2.342977 -0.908304
c  0.038842  1.321412 -0.836470
d  0.050385 -0.373322  0.595604

In [9]:
bool_df = df > 0

In [10]:
bool_df

       X      Y      Z
a  False   True  False
b  False   True  False
c   True   True  False
d   True  False   True

In [12]:
df[df > 0]

          X         Y         Z
a       NaN  0.063832       NaN
b       NaN  2.342977       NaN
c  0.038842  1.321412       NaN
d  0.050385       NaN  0.595604

In [13]:
df

          X         Y         Z
a -0.075704  0.063832 -0.584938
b -0.336259  2.342977 -0.908304
c  0.038842  1.321412 -0.836470
d  0.050385 -0.373322  0.595604

In [14]:
df['Y'] > 1

a    False
b     True
c     True
d    False
Name: Y, dtype: bool

In [16]:
type(df['Y'])

pandas.core.series.Series

In [17]:
df[df['Y'] > 1]

          X         Y         Z
b -0.336259  2.342977 -0.908304
c  0.038842  1.321412 -0.836470

In [18]:
df

          X         Y         Z
a -0.075704  0.063832 -0.584938
b -0.336259  2.342977 -0.908304
c  0.038842  1.321412 -0.836470
d  0.050385 -0.373322  0.595604

In [20]:
res_df = df[df['X'] < 0]

In [21]:
res_df

          X         Y         Z
a -0.075704  0.063832 -0.584938
b -0.336259  2.342977 -0.908304

In [22]:
res_df['Z']

a   -0.584938
b   -0.908304
Name: Z, dtype: float64

In [27]:
df[df['X'] < 0][['Z', 'X']]

          Z         X
a -0.584938 -0.075704
b -0.908304 -0.336259

In [30]:
bool_ser = df['X'] < 0

In [31]:
bool_ser

a     True
b     True
c    False
d    False
Name: X, dtype: bool

In [32]:
result_df = df[bool_ser]

In [33]:
result_df

          X         Y         Z
a -0.075704  0.063832 -0.584938
b -0.336259  2.342977 -0.908304

In [35]:
result_df[['Z', 'X']]

          Z         X
a -0.584938 -0.075704
b -0.908304 -0.336259

In [36]:
df

          X         Y         Z
a -0.075704  0.063832 -0.584938
b -0.336259  2.342977 -0.908304
c  0.038842  1.321412 -0.836470
d  0.050385 -0.373322  0.595604

In [37]:
df[(df['X'] > 0) & (df['Z'] < 0)]

          X         Y        Z
c  0.038842  1.321412 -0.83647

In [38]:
df[(df['X'] > 0) | (df['Z'] < 0)]

          X         Y         Z
a -0.075704  0.063832 -0.584938
b -0.336259  2.342977 -0.908304
c  0.038842  1.321412 -0.836470
d  0.050385 -0.373322  0.595604

In [39]:
df

          X         Y         Z
a -0.075704  0.063832 -0.584938
b -0.336259  2.342977 -0.908304
c  0.038842  1.321412 -0.836470
d  0.050385 -0.373322  0.595604

In [40]:
df.reset_index()

  index         X         Y         Z
0     a -0.075704  0.063832 -0.584938
1     b -0.336259  2.342977 -0.908304
2     c  0.038842  1.321412 -0.836470
3     d  0.050385 -0.373322  0.595604

In [41]:
df

          X         Y         Z
a -0.075704  0.063832 -0.584938
b -0.336259  2.342977 -0.908304
c  0.038842  1.321412 -0.836470
d  0.050385 -0.373322  0.595604

In [42]:
z1 = [2, 3, 5, 6]

In [43]:
df['Z1'] = z1

In [44]:
df

          X         Y         Z  Z1
a -0.075704  0.063832 -0.584938   2
b -0.336259  2.342977 -0.908304   3
c  0.038842  1.321412 -0.836470   5
d  0.050385 -0.373322  0.595604   6

In [45]:
df.set_index('Z1')

           X         Y         Z
Z1
2  -0.075704  0.063832 -0.584938
3  -0.336259  2.342977 -0.908304
5   0.038842  1.321412 -0.836470
6   0.050385 -0.373322  0.595604

In [46]:
df

          X         Y         Z  Z1
a -0.075704  0.063832 -0.584938   2
b -0.336259  2.342977 -0.908304   3
c  0.038842  1.321412 -0.836470   5
d  0.050385 -0.373322  0.595604   6